{
    "surahName": "Al-Hijr",
    "surahNameArabic": "الحجر",
    "surahNameArabicLong": "سورة الحجر",
    "surahNameTranslation": "The Rock",
    "revelationPlace": "Mecca",
    "totalAyah": 99,
    "surahNo": 15,
    "english": [
        "Alif-Lãm-Ra. These are the verses of the Book; the clear Quran.",
        "˹The day will come when˺ the disbelievers will certainly wish they had submitted ˹to Allah˺.",
        "˹So˺ let them eat and enjoy themselves and be diverted by ˹false˺ hope, for they will soon know.",
        "We have never destroyed a society without a destined term.",
        "No people can advance their doom, nor can they delay it.",
        "They say, “O you to whom the Reminder is revealed! You must be insane!",
        "Why do you not bring us the angels, if what you say is true?”",
        "We do not send the angels down except for a just cause, and then ˹the end of˺ the disbelievers will not be delayed.",
        "It is certainly We Who have revealed the Reminder, and it is certainly We Who will preserve it.",
        "Indeed, We sent messengers before you ˹O Prophet˺ among the groups of early peoples",
        "but no messenger ever came to them without being mocked.",
        "This is how We allow disbelief ˹to steep˺ into the hearts of the wicked.",
        "They would not believe in this ˹Quran˺ despite the ˹many˺ examples of those ˹destroyed˺ before.",
        "And even if We opened for them a gate to heaven, through which they continued to ascend",
        "still they would say, “Our eyes have truly been dazzled! In fact, we must have been bewitched.”",
        "Indeed, We have placed constellations in the sky, and adorned it for all to see.",
        "And We protected it from every accursed devil",
        "except the one eavesdropping, who is then pursued by a visible flare.",
        "As for the earth, We spread it out and placed upon it firm mountains, and caused everything to grow there in perfect balance.",
        "And We made in it means of sustenance for you and others, who you do not provide for.",
        "There is not any means ˹of sustenance˺ whose reserves We do not hold, only bringing it forth in precise measure.",
        "We send fertilizing winds, and bring down rain from the sky for you to drink. It is not you who hold its reserves.",
        "Surely it is We Who give life and cause death. And We are the ˹Eternal˺ Successor.",
        "We certainly know those who have gone before you and those who will come after ˹you˺.",
        "Surely your Lord ˹alone˺ will gather them together ˹for judgment˺. He is truly All-Wise, All-Knowing.",
        "Indeed, We created man from sounding clay moulded from black mud.",
        "As for the jinn, We created them earlier from smokeless fire.",
        "˹Remember, O  Prophet˺ when your Lord said to the angels, “I am going to create a human being from sounding clay moulded from black mud.",
        "So when I have fashioned him and had a spirit of My Own ˹creation˺ breathed into him, fall down in prostration to him.”",
        "So the angels prostrated all together—",
        "but not Iblîs, who refused to prostrate with the others.",
        "Allah asked, “O Iblîs! What is the matter with you that you did not join others in prostration?”",
        "He replied, “It is not for me to prostrate to a human You created from sounding clay moulded from black mud.”",
        "Allah commanded, “Then get out of Paradise, for you are truly cursed.",
        "And surely upon you is condemnation until the Day of Judgment.”",
        "Satan appealed, “My Lord! Then delay my end until the Day of their resurrection.”",
        "Allah said, “You will be delayed",
        "until the appointed Day.”",
        "Satan responded, “My Lord! For allowing me to stray I will surely tempt them on earth and mislead them all together",
        "except Your chosen servants among them.”",
        "Allah said, “This is the Way, binding on Me:",
        "you will certainly have no authority over My servants, except the deviant who follow you",
        "and surely Hell is their destined place, all together.",
        "It has seven gates, to each a group of them is designated.”",
        "Indeed, the righteous will be amid Gardens and springs.",
        "˹It will be said to them,˺ “Enter in peace and security.”",
        "We will remove whatever bitterness they had in their hearts. In a friendly manner, they will be on thrones, facing one another.",
        "No fatigue will touch them there, nor will they ever be asked to leave.",
        "Inform My servants ˹O Prophet˺ that I am truly the All-Forgiving, Most Merciful",
        "and that My torment is indeed the most painful.",
        "And inform them ˹O Prophet˺ about Abraham’s guests",
        "who entered upon him and greeted ˹him with˺, “Peace!” He ˹later˺ said, “Surely we are afraid of you.”",
        "They reassured ˹him˺, “Do not be afraid! Surely we give you good news of a knowledgeable son.”",
        "He wondered, “Do you give me good news despite my old age? What unlikely news!”",
        "They responded, “We give you good news in all truth, so do not be one of those who despair.”",
        "He exclaimed, “Who would despair of the mercy of their Lord except the misguided?”",
        "He ˹then˺ added, “What is your mission, O  messenger-angels?”",
        "They replied, “We have actually been sent to a wicked people.",
        "As for the family of Lot, we will certainly deliver them all",
        "except his wife. We have determined that she will be one of the doomed.”",
        "So when the messengers came to the family of Lot",
        "he said, “You are surely an unfamiliar people!”",
        "They responded, “We have come to you with that ˹torment˺ which they have doubted.",
        "We come to you with the truth, and we are certainly truthful.",
        "So travel with your family in the dark of night, and follow ˹closely˺ behind them. Do not let any of you look back, and go where you are commanded.”",
        "We revealed to him this decree: “Those ˹sinners˺ will be uprooted in the morning.”",
        "And there came the men of the city, rejoicing.",
        "Lot pleaded, “Indeed, these are my guests, so do not embarrass me.",
        "Fear Allah and do not humiliate me.”",
        "They responded, “Have we not forbidden you from protecting anyone?”",
        "He said, “O my people! Here are my daughters ˹so marry them˺ if you wish to do so.”",
        "By your life ˹O Prophet˺, they certainly wandered blindly, intoxicated ˹by lust˺.",
        "So the ˹mighty˺ blast overtook them at sunrise.",
        "And We turned the cities ˹of Sodom and Gomorrah˺ upside down and rained upon them stones of baked clay.",
        "Surely in this are signs for those who contemplate.",
        "Their ruins still lie along a known route.",
        "Surely in this is a sign for those who believe.",
        "And the residents of the Forest were truly wrongdoers",
        "so We inflicted punishment upon them. The ruins of both nations still lie on a well-known road.",
        "Indeed, the residents of the Stone Valley also denied the messengers.",
        "We gave them Our signs, but they turned away from them.",
        "They carved their homes in the mountains, feeling secure.",
        "But the ˹mighty˺ blast overtook them in the morning",
        "and all they achieved was of no help to them.",
        "We have not created the heavens and the earth and everything in between except for a purpose. And the Hour is certain to come, so forgive graciously.",
        "Surely your Lord is the Master Creator, All-Knowing.",
        "We have certainly granted you the seven often-repeated verses and the great Quran.",
        "Do not let your eyes crave the ˹fleeting˺ pleasures We have provided for some of the disbelievers, nor grieve for them. And be gracious to the believers.",
        "And say, “I am truly sent with a clear warning”—",
        "˹a warning˺ similar to what We sent to those who divided ˹the Scriptures˺",
        "who ˹now˺ accept parts of the Quran, rejecting others.",
        "So by your Lord! We will certainly question them all",
        "about what they used to do.",
        "So proclaim what you have been commanded, and turn away from the polytheists.",
        "Surely We will be sufficient for you against the mockers",
        "who set up ˹other˺ gods with Allah. They will soon come to know.",
        "We certainly know that your heart is truly distressed by what they say.",
        "So glorify the praises of your Lord and be one of those who ˹always˺ pray",
        "and worship your Lord until the inevitable comes your way."
    ],
    "arabic1": [
        " الٓر ۚ تِلْكَ ءَايَـٰتُ ٱلْكِتَـٰبِ وَقُرْءَانٍ مُّبِينٍ",
        "رُّبَمَا يَوَدُّ ٱلَّذِينَ كَفَرُوا۟ لَوْ كَانُوا۟ مُسْلِمِينَ",
        "ذَرْهُمْ يَأْكُلُوا۟ وَيَتَمَتَّعُوا۟ وَيُلْهِهِمُ ٱلْأَمَلُ ۖ فَسَوْفَ يَعْلَمُونَ",
        "وَمَآ أَهْلَكْنَا مِن قَرْيَةٍ إِلَّا وَلَهَا كِتَابٌ مَّعْلُومٌ",
        "مَّا تَسْبِقُ مِنْ أُمَّةٍ أَجَلَهَا وَمَا يَسْتَـْٔخِرُونَ",
        "وَقَالُوا۟ يَـٰٓأَيُّهَا ٱلَّذِى نُزِّلَ عَلَيْهِ ٱلذِّكْرُ إِنَّكَ لَمَجْنُونٌ",
        "لَّوْ مَا تَأْتِينَا بِٱلْمَلَـٰٓئِكَةِ إِن كُنتَ مِنَ ٱلصَّـٰدِقِينَ",
        "مَا نُنَزِّلُ ٱلْمَلَـٰٓئِكَةَ إِلَّا بِٱلْحَقِّ وَمَا كَانُوٓا۟ إِذًا مُّنظَرِينَ",
        "إِنَّا نَحْنُ نَزَّلْنَا ٱلذِّكْرَ وَإِنَّا لَهُۥ لَحَـٰفِظُونَ",
        "وَلَقَدْ أَرْسَلْنَا مِن قَبْلِكَ فِى شِيَعِ ٱلْأَوَّلِينَ",
        "وَمَا يَأْتِيهِم مِّن رَّسُولٍ إِلَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ",
        "كَذَٰلِكَ نَسْلُكُهُۥ فِى قُلُوبِ ٱلْمُجْرِمِينَ",
        "لَا يُؤْمِنُونَ بِهِۦ ۖ وَقَدْ خَلَتْ سُنَّةُ ٱلْأَوَّلِينَ",
        "وَلَوْ فَتَحْنَا عَلَيْهِم بَابًا مِّنَ ٱلسَّمَآءِ فَظَلُّوا۟ فِيهِ يَعْرُجُونَ",
        "لَقَالُوٓا۟ إِنَّمَا سُكِّرَتْ أَبْصَـٰرُنَا بَلْ نَحْنُ قَوْمٌ مَّسْحُورُونَ",
        "وَلَقَدْ جَعَلْنَا فِى ٱلسَّمَآءِ بُرُوجًا وَزَيَّنَّـٰهَا لِلنَّـٰظِرِينَ",
        "وَحَفِظْنَـٰهَا مِن كُلِّ شَيْطَـٰنٍ رَّجِيمٍ",
        "إِلَّا مَنِ ٱسْتَرَقَ ٱلسَّمْعَ فَأَتْبَعَهُۥ شِهَابٌ مُّبِينٌ",
        "وَٱلْأَرْضَ مَدَدْنَـٰهَا وَأَلْقَيْنَا فِيهَا رَوَٰسِىَ وَأَنۢبَتْنَا فِيهَا مِن كُلِّ شَىْءٍ مَّوْزُونٍ",
        "وَجَعَلْنَا لَكُمْ فِيهَا مَعَـٰيِشَ وَمَن لَّسْتُمْ لَهُۥ بِرَٰزِقِينَ",
        "وَإِن مِّن شَىْءٍ إِلَّا عِندَنَا خَزَآئِنُهُۥ وَمَا نُنَزِّلُهُۥٓ إِلَّا بِقَدَرٍ مَّعْلُومٍ",
        "وَأَرْسَلْنَا ٱلرِّيَـٰحَ لَوَٰقِحَ فَأَنزَلْنَا مِنَ ٱلسَّمَآءِ مَآءً فَأَسْقَيْنَـٰكُمُوهُ وَمَآ أَنتُمْ لَهُۥ بِخَـٰزِنِينَ",
        "وَإِنَّا لَنَحْنُ نُحْىِۦ وَنُمِيتُ وَنَحْنُ ٱلْوَٰرِثُونَ",
        "وَلَقَدْ عَلِمْنَا ٱلْمُسْتَقْدِمِينَ مِنكُمْ وَلَقَدْ عَلِمْنَا ٱلْمُسْتَـْٔخِرِينَ",
        "وَإِنَّ رَبَّكَ هُوَ يَحْشُرُهُمْ ۚ إِنَّهُۥ حَكِيمٌ عَلِيمٌ",
        "وَلَقَدْ خَلَقْنَا ٱلْإِنسَـٰنَ مِن صَلْصَـٰلٍ مِّنْ حَمَإٍ مَّسْنُونٍ",
        "وَٱلْجَآنَّ خَلَقْنَـٰهُ مِن قَبْلُ مِن نَّارِ ٱلسَّمُومِ",
        "وَإِذْ قَالَ رَبُّكَ لِلْمَلَـٰٓئِكَةِ إِنِّى خَـٰلِقٌۢ بَشَرًا مِّن صَلْصَـٰلٍ مِّنْ حَمَإٍ مَّسْنُونٍ",
        "فَإِذَا سَوَّيْتُهُۥ وَنَفَخْتُ فِيهِ مِن رُّوحِى فَقَعُوا۟ لَهُۥ سَـٰجِدِينَ",
        "فَسَجَدَ ٱلْمَلَـٰٓئِكَةُ كُلُّهُمْ أَجْمَعُونَ",
        "إِلَّآ إِبْلِيسَ أَبَىٰٓ أَن يَكُونَ مَعَ ٱلسَّـٰجِدِينَ",
        "قَالَ يَـٰٓإِبْلِيسُ مَا لَكَ أَلَّا تَكُونَ مَعَ ٱلسَّـٰجِدِينَ",
        "قَالَ لَمْ أَكُن لِّأَسْجُدَ لِبَشَرٍ خَلَقْتَهُۥ مِن صَلْصَـٰلٍ مِّنْ حَمَإٍ مَّسْنُونٍ",
        "قَالَ فَٱخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ",
        "وَإِنَّ عَلَيْكَ ٱللَّعْنَةَ إِلَىٰ يَوْمِ ٱلدِّينِ",
        "قَالَ رَبِّ فَأَنظِرْنِىٓ إِلَىٰ يَوْمِ يُبْعَثُونَ",
        "قَالَ فَإِنَّكَ مِنَ ٱلْمُنظَرِينَ",
        "إِلَىٰ يَوْمِ ٱلْوَقْتِ ٱلْمَعْلُومِ",
        "قَالَ رَبِّ بِمَآ أَغْوَيْتَنِى لَأُزَيِّنَنَّ لَهُمْ فِى ٱلْأَرْضِ وَلَأُغْوِيَنَّهُمْ أَجْمَعِينَ",
        "إِلَّا عِبَادَكَ مِنْهُمُ ٱلْمُخْلَصِينَ",
        "قَالَ هَـٰذَا صِرَٰطٌ عَلَىَّ مُسْتَقِيمٌ",
        "إِنَّ عِبَادِى لَيْسَ لَكَ عَلَيْهِمْ سُلْطَـٰنٌ إِلَّا مَنِ ٱتَّبَعَكَ مِنَ ٱلْغَاوِينَ",
        "وَإِنَّ جَهَنَّمَ لَمَوْعِدُهُمْ أَجْمَعِينَ",
        "لَهَا سَبْعَةُ أَبْوَٰبٍ لِّكُلِّ بَابٍ مِّنْهُمْ جُزْءٌ مَّقْسُومٌ",
        "إِنَّ ٱلْمُتَّقِينَ فِى جَنَّـٰتٍ وَعُيُونٍ",
        "ٱدْخُلُوهَا بِسَلَـٰمٍ ءَامِنِينَ",
        "وَنَزَعْنَا مَا فِى صُدُورِهِم مِّنْ غِلٍّ إِخْوَٰنًا عَلَىٰ سُرُرٍ مُّتَقَـٰبِلِينَ",
        "لَا يَمَسُّهُمْ فِيهَا نَصَبٌ وَمَا هُم مِّنْهَا بِمُخْرَجِينَ",
        "۞ نَبِّئْ عِبَادِىٓ أَنِّىٓ أَنَا ٱلْغَفُورُ ٱلرَّحِيمُ",
        "وَأَنَّ عَذَابِى هُوَ ٱلْعَذَابُ ٱلْأَلِيمُ",
        "وَنَبِّئْهُمْ عَن ضَيْفِ إِبْرَٰهِيمَ",
        "إِذْ دَخَلُوا۟ عَلَيْهِ فَقَالُوا۟ سَلَـٰمًا قَالَ إِنَّا مِنكُمْ وَجِلُونَ",
        "قَالُوا۟ لَا تَوْجَلْ إِنَّا نُبَشِّرُكَ بِغُلَـٰمٍ عَلِيمٍ",
        "قَالَ أَبَشَّرْتُمُونِى عَلَىٰٓ أَن مَّسَّنِىَ ٱلْكِبَرُ فَبِمَ تُبَشِّرُونَ",
        "قَالُوا۟ بَشَّرْنَـٰكَ بِٱلْحَقِّ فَلَا تَكُن مِّنَ ٱلْقَـٰنِطِينَ",
        "قَالَ وَمَن يَقْنَطُ مِن رَّحْمَةِ رَبِّهِۦٓ إِلَّا ٱلضَّآلُّونَ",
        "قَالَ فَمَا خَطْبُكُمْ أَيُّهَا ٱلْمُرْسَلُونَ",
        "قَالُوٓا۟ إِنَّآ أُرْسِلْنَآ إِلَىٰ قَوْمٍ مُّجْرِمِينَ",
        "إِلَّآ ءَالَ لُوطٍ إِنَّا لَمُنَجُّوهُمْ أَجْمَعِينَ",
        "إِلَّا ٱمْرَأَتَهُۥ قَدَّرْنَآ ۙ إِنَّهَا لَمِنَ ٱلْغَـٰبِرِينَ",
        "فَلَمَّا جَآءَ ءَالَ لُوطٍ ٱلْمُرْسَلُونَ",
        "قَالَ إِنَّكُمْ قَوْمٌ مُّنكَرُونَ",
        "قَالُوا۟ بَلْ جِئْنَـٰكَ بِمَا كَانُوا۟ فِيهِ يَمْتَرُونَ",
        "وَأَتَيْنَـٰكَ بِٱلْحَقِّ وَإِنَّا لَصَـٰدِقُونَ",
        "فَأَسْرِ بِأَهْلِكَ بِقِطْعٍ مِّنَ ٱلَّيْلِ وَٱتَّبِعْ أَدْبَـٰرَهُمْ وَلَا يَلْتَفِتْ مِنكُمْ أَحَدٌ وَٱمْضُوا۟ حَيْثُ تُؤْمَرُونَ",
        "وَقَضَيْنَآ إِلَيْهِ ذَٰلِكَ ٱلْأَمْرَ أَنَّ دَابِرَ هَـٰٓؤُلَآءِ مَقْطُوعٌ مُّصْبِحِينَ",
        "وَجَآءَ أَهْلُ ٱلْمَدِينَةِ يَسْتَبْشِرُونَ",
        "قَالَ إِنَّ هَـٰٓؤُلَآءِ ضَيْفِى فَلَا تَفْضَحُونِ",
        "وَٱتَّقُوا۟ ٱللَّهَ وَلَا تُخْزُونِ",
        "قَالُوٓا۟ أَوَلَمْ نَنْهَكَ عَنِ ٱلْعَـٰلَمِينَ",
        "قَالَ هَـٰٓؤُلَآءِ بَنَاتِىٓ إِن كُنتُمْ فَـٰعِلِينَ",
        "لَعَمْرُكَ إِنَّهُمْ لَفِى سَكْرَتِهِمْ يَعْمَهُونَ",
        "فَأَخَذَتْهُمُ ٱلصَّيْحَةُ مُشْرِقِينَ",
        "فَجَعَلْنَا عَـٰلِيَهَا سَافِلَهَا وَأَمْطَرْنَا عَلَيْهِمْ حِجَارَةً مِّن سِجِّيلٍ",
        "إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّلْمُتَوَسِّمِينَ",
        "وَإِنَّهَا لَبِسَبِيلٍ مُّقِيمٍ",
        "إِنَّ فِى ذَٰلِكَ لَـَٔايَةً لِّلْمُؤْمِنِينَ",
        "وَإِن كَانَ أَصْحَـٰبُ ٱلْأَيْكَةِ لَظَـٰلِمِينَ",
        "فَٱنتَقَمْنَا مِنْهُمْ وَإِنَّهُمَا لَبِإِمَامٍ مُّبِينٍ",
        "وَلَقَدْ كَذَّبَ أَصْحَـٰبُ ٱلْحِجْرِ ٱلْمُرْسَلِينَ",
        "وَءَاتَيْنَـٰهُمْ ءَايَـٰتِنَا فَكَانُوا۟ عَنْهَا مُعْرِضِينَ",
        "وَكَانُوا۟ يَنْحِتُونَ مِنَ ٱلْجِبَالِ بُيُوتًا ءَامِنِينَ",
        "فَأَخَذَتْهُمُ ٱلصَّيْحَةُ مُصْبِحِينَ",
        "فَمَآ أَغْنَىٰ عَنْهُم مَّا كَانُوا۟ يَكْسِبُونَ",
        "وَمَا خَلَقْنَا ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ وَمَا بَيْنَهُمَآ إِلَّا بِٱلْحَقِّ ۗ وَإِنَّ ٱلسَّاعَةَ لَـَٔاتِيَةٌ ۖ فَٱصْفَحِ ٱلصَّفْحَ ٱلْجَمِيلَ",
        "إِنَّ رَبَّكَ هُوَ ٱلْخَلَّـٰقُ ٱلْعَلِيمُ",
        "وَلَقَدْ ءَاتَيْنَـٰكَ سَبْعًا مِّنَ ٱلْمَثَانِى وَٱلْقُرْءَانَ ٱلْعَظِيمَ",
        "لَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِۦٓ أَزْوَٰجًا مِّنْهُمْ وَلَا تَحْزَنْ عَلَيْهِمْ وَٱخْفِضْ جَنَاحَكَ لِلْمُؤْمِنِينَ",
        "وَقُلْ إِنِّىٓ أَنَا ٱلنَّذِيرُ ٱلْمُبِينُ",
        "كَمَآ أَنزَلْنَا عَلَى ٱلْمُقْتَسِمِينَ",
        "ٱلَّذِينَ جَعَلُوا۟ ٱلْقُرْءَانَ عِضِينَ",
        "فَوَرَبِّكَ لَنَسْـَٔلَنَّهُمْ أَجْمَعِينَ",
        "عَمَّا كَانُوا۟ يَعْمَلُونَ",
        "فَٱصْدَعْ بِمَا تُؤْمَرُ وَأَعْرِضْ عَنِ ٱلْمُشْرِكِينَ",
        "إِنَّا كَفَيْنَـٰكَ ٱلْمُسْتَهْزِءِينَ",
        "ٱلَّذِينَ يَجْعَلُونَ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَ ۚ فَسَوْفَ يَعْلَمُونَ",
        "وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ",
        "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُن مِّنَ ٱلسَّـٰجِدِينَ",
        "وَٱعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ ٱلْيَقِينُ"
    ],
    "arabic2": [
        "الر تلك ايات الكتاب وقران مبين",
        "ربما يود الذين كفروا لو كانوا مسلمين",
        "ذرهم ياكلوا ويتمتعوا ويلههم الامل فسوف يعلمون",
        "وما اهلكنا من قرية الا ولها كتاب معلوم",
        "ما تسبق من امة اجلها وما يستاخرون",
        "وقالوا يا ايها الذي نزل عليه الذكر انك لمجنون",
        "لو ما تاتينا بالملائكة ان كنت من الصادقين",
        "ما ننزل الملائكة الا بالحق وما كانوا اذا منظرين",
        "انا نحن نزلنا الذكر وانا له لحافظون",
        "ولقد ارسلنا من قبلك في شيع الاولين",
        "وما ياتيهم من رسول الا كانوا به يستهزئون",
        "كذلك نسلكه في قلوب المجرمين",
        "لا يؤمنون به وقد خلت سنة الاولين",
        "ولو فتحنا عليهم بابا من السماء فظلوا فيه يعرجون",
        "لقالوا انما سكرت ابصارنا بل نحن قوم مسحورون",
        "ولقد جعلنا في السماء بروجا وزيناها للناظرين",
        "وحفظناها من كل شيطان رجيم",
        "الا من استرق السمع فاتبعه شهاب مبين",
        "والارض مددناها والقينا فيها رواسي وانبتنا فيها من كل شيء موزون",
        "وجعلنا لكم فيها معايش ومن لستم له برازقين",
        "وان من شيء الا عندنا خزائنه وما ننزله الا بقدر معلوم",
        "وارسلنا الرياح لواقح فانزلنا من السماء ماء فاسقيناكموه وما انتم له بخازنين",
        "وانا لنحن نحيي ونميت ونحن الوارثون",
        "ولقد علمنا المستقدمين منكم ولقد علمنا المستاخرين",
        "وان ربك هو يحشرهم انه حكيم عليم",
        "ولقد خلقنا الانسان من صلصال من حما مسنون",
        "والجان خلقناه من قبل من نار السموم",
        "واذ قال ربك للملائكة اني خالق بشرا من صلصال من حما مسنون",
        "فاذا سويته ونفخت فيه من روحي فقعوا له ساجدين",
        "فسجد الملائكة كلهم اجمعون",
        "الا ابليس ابى ان يكون مع الساجدين",
        "قال يا ابليس ما لك الا تكون مع الساجدين",
        "قال لم اكن لاسجد لبشر خلقته من صلصال من حما مسنون",
        "قال فاخرج منها فانك رجيم",
        "وان عليك اللعنة الى يوم الدين",
        "قال رب فانظرني الى يوم يبعثون",
        "قال فانك من المنظرين",
        "الى يوم الوقت المعلوم",
        "قال رب بما اغويتني لازينن لهم في الارض ولاغوينهم اجمعين",
        "الا عبادك منهم المخلصين",
        "قال هذا صراط علي مستقيم",
        "ان عبادي ليس لك عليهم سلطان الا من اتبعك من الغاوين",
        "وان جهنم لموعدهم اجمعين",
        "لها سبعة ابواب لكل باب منهم جزء مقسوم",
        "ان المتقين في جنات وعيون",
        "ادخلوها بسلام امنين",
        "ونزعنا ما في صدورهم من غل اخوانا على سرر متقابلين",
        "لا يمسهم فيها نصب وما هم منها بمخرجين",
        "نبئ عبادي اني انا الغفور الرحيم",
        "وان عذابي هو العذاب الاليم",
        "ونبئهم عن ضيف ابراهيم",
        "اذ دخلوا عليه فقالوا سلاما قال انا منكم وجلون",
        "قالوا لا توجل انا نبشرك بغلام عليم",
        "قال ابشرتموني على ان مسني الكبر فبم تبشرون",
        "قالوا بشرناك بالحق فلا تكن من القانطين",
        "قال ومن يقنط من رحمة ربه الا الضالون",
        "قال فما خطبكم ايها المرسلون",
        "قالوا انا ارسلنا الى قوم مجرمين",
        "الا ال لوط انا لمنجوهم اجمعين",
        "الا امراته قدرنا انها لمن الغابرين",
        "فلما جاء ال لوط المرسلون",
        "قال انكم قوم منكرون",
        "قالوا بل جئناك بما كانوا فيه يمترون",
        "واتيناك بالحق وانا لصادقون",
        "فاسر باهلك بقطع من الليل واتبع ادبارهم ولا يلتفت منكم احد وامضوا حيث تؤمرون",
        "وقضينا اليه ذلك الامر ان دابر هؤلاء مقطوع مصبحين",
        "وجاء اهل المدينة يستبشرون",
        "قال ان هؤلاء ضيفي فلا تفضحون",
        "واتقوا الله ولا تخزون",
        "قالوا اولم ننهك عن العالمين",
        "قال هؤلاء بناتي ان كنتم فاعلين",
        "لعمرك انهم لفي سكرتهم يعمهون",
        "فاخذتهم الصيحة مشرقين",
        "فجعلنا عاليها سافلها وامطرنا عليهم حجارة من سجيل",
        "ان في ذلك لايات للمتوسمين",
        "وانها لبسبيل مقيم",
        "ان في ذلك لاية للمؤمنين",
        "وان كان اصحاب الايكة لظالمين",
        "فانتقمنا منهم وانهما لبامام مبين",
        "ولقد كذب اصحاب الحجر المرسلين",
        "واتيناهم اياتنا فكانوا عنها معرضين",
        "وكانوا ينحتون من الجبال بيوتا امنين",
        "فاخذتهم الصيحة مصبحين",
        "فما اغنى عنهم ما كانوا يكسبون",
        "وما خلقنا السماوات والارض وما بينهما الا بالحق وان الساعة لاتية فاصفح الصفح الجميل",
        "ان ربك هو الخلاق العليم",
        "ولقد اتيناك سبعا من المثاني والقران العظيم",
        "لا تمدن عينيك الى ما متعنا به ازواجا منهم ولا تحزن عليهم واخفض جناحك للمؤمنين",
        "وقل اني انا النذير المبين",
        "كما انزلنا على المقتسمين",
        "الذين جعلوا القران عضين",
        "فوربك لنسالنهم اجمعين",
        "عما كانوا يعملون",
        "فاصدع بما تؤمر واعرض عن المشركين",
        "انا كفيناك المستهزئين",
        "الذين يجعلون مع الله الها اخر فسوف يعلمون",
        "ولقد نعلم انك يضيق صدرك بما يقولون",
        "فسبح بحمد ربك وكن من الساجدين",
        "واعبد ربك حتى ياتيك اليقين"
    ]
}